УРВ_файловая/src/Documents/ПланированиеЗагрузкиЛК/ПланированиеЗагрузкиЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланированиеЗагрузкиЛК</name>
  <registerRecords>InformationRegister.РасписаниеКонсультаций</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Замещение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Перепланирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>ДатаВремяНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Абоненты</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.ПользователиСервисов</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийЗаписи</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремяОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КрайнийСрок</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапретитьЗамещение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Событие</name>
      <type>
        <types>DocumentRef.Обращение</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеXML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеТекст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтменяемыеПланы</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремяНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремяОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УРВ_файловая/src/Documents/ПланированиеЗагрузкиЛК/ManagerModule.bsl
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	ДанныеЗаполнения = БоР_ОбщийМодульКлиентСервер.ПолучитьПолеСтруктуры(Параметры, "Основание");
	Если ДанныеЗаполнения <> Неопределено Тогда
		//Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.франЗадание") И ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		//	СтандартнаяОбработка = Ложь;
		//	ВыбраннаяФорма = "Обработка.РасписаниеЛК.Форма.ФормаПланирования";
		//	
		//	Параметры.Вставить("ДанныеЗаполнения"		, ДанныеЗаполнения);
		//	Параметры.Вставить("ВводНаОсновании"		, Истина);
		//	МассивПользователей = Справочники.Пользователи.ПолучитьПользователейПоФизЛицу(ДанныеЗаполнения.Сотрудник);
		//	Если МассивПользователей.Количество() > 0 Тогда
		//		Адрес_ДанныеСлотов = СформироватьДанныеСлотов(МассивПользователей[0], '00010101', '00010101', 0);
		//		Параметры.Вставить("Адрес_ДанныеСлотов"			, Адрес_ДанныеСлотов);
		//	КонецЕсли;
		//	Параметры.Вставить("ПутьКМетаданнымОбработки"	, "Обработка.РасписаниеЛК");
		//Иначе
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Событие") И ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "Обработка.РасписаниеЛК.Форма.ФормаПланирования";
			
			Параметры.Вставить("ДанныеЗаполнения"		, ДанныеЗаполнения);
			Параметры.Вставить("ВводНаОсновании"		, Истина);
			Адрес_ДанныеСлотов = СформироватьДанныеСлотов(ДанныеЗаполнения.Ответственный, '00010101', '00010101', 0);
			Параметры.Вставить("Адрес_ДанныеСлотов"			, Адрес_ДанныеСлотов);
			Параметры.Вставить("ПутьКМетаданнымОбработки"	, "Обработка.РасписаниеЛК");
		//ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПакетЧасов") И ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		//	СтандартнаяОбработка = Ложь;
		//	ВыбраннаяФорма = "Обработка.РасписаниеЛК.Форма.ФормаПланирования";
		//	
		//	Параметры.Вставить("ДанныеЗаполнения"		, ДанныеЗаполнения);
		//	Параметры.Вставить("ВводНаОсновании"		, Истина);
		//	Адрес_ДанныеСлотов = СформироватьДанныеСлотов(ДанныеЗаполнения.Сотрудник, '00010101', '00010101', 0);
		//	Параметры.Вставить("Адрес_ДанныеСлотов"			, Адрес_ДанныеСлотов);
		//	Параметры.Вставить("ПутьКМетаданнымОбработки"	, "Обработка.РасписаниеЛК");
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

// БоР : Создание подходящей структуры для передачи в форму планирования 16.08.2017 17:25:07
Функция СформироватьДанныеСлотов(Сотрудник, ДатаВремяНачала, ДатаВремяОкончания, Продолжительность) Экспорт
	ДанныеСотрудника = Новый Структура;
	ДанныеСотрудника.Вставить("Сотрудник"				, Сотрудник);
	ДанныеСотрудника.Вставить("Слоты"					, Новый Массив);
	
	СвойстваСлота = Новый Структура;
	СвойстваСлота.Вставить("Сотрудник"				, Сотрудник);
	СвойстваСлота.Вставить("ДатаВремяНачала"		, ДатаВремяНачала);
	СвойстваСлота.Вставить("ДатаВремяОкончания"		, ДатаВремяОкончания);
	СвойстваСлота.Вставить("Продолжительность"		, Продолжительность);
	
	ДанныеСотрудника.Слоты.Добавить(СвойстваСлота);
	
	ДанныеСлотов = Новый Массив;
	ДанныеСлотов.Добавить(ДанныеСотрудника);
	
	Адрес_ДанныеСлотов = ПоместитьВоВременноеХранилище(ДанныеСлотов, Новый УникальныйИдентификатор);
	ВозВрат Адрес_ДанныеСлотов;
	
КонецФункции
